src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы/Forms/ФормаЭлементаКонтурСтрахование/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 
 
 // Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Параметры.Свойство("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
		Объект.КлючПриложения = Новый УникальныйИдентификатор();
		СформироватьНаименование();
		Если ЗначениеЗаполнено(Объект.ТипВнешнейСистемы) Тогда
			Элементы.ТипВнешнейСистемы.Видимость = Ложь;
		Иначе
			Элементы.ТипВнешнейСистемы.Видимость = Истина;
		КонецЕсли;    
		Элементы.ГруппаУдалить.Видимость 		 = Ложь;
	Иначе
		ПараметрыВнешнейСистемы = Объект.Ссылка.Параметры.Получить();		
		Элементы.ТипВнешнейСистемы.Видимость = Ложь;

		Если ЗначениеЗаполнено(ПараметрыВнешнейСистемы) И ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура") Тогда
			ПараметрыВнешнейСистемы.Свойство("clientId"				, ЭтотОбъект.clientId);
			ПараметрыВнешнейСистемы.Свойство("clientSecret"			, ЭтотОбъект.clientSecret); 
			ПараметрыВнешнейСистемы.Свойство("Демо"					, ЭтотОбъект.Демо); 

			Если ПараметрыВнешнейСистемы.Свойство("МассивОрганизаций") Тогда				
				МассивОрганизаций = ПараметрыВнешнейСистемы.МассивОрганизаций;		
				
				Для Каждого Строка Из МассивОрганизаций Цикл 
					Новаястрока = ТаблицаОрганизаций.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;              
	
	УидСессии = ЛичныйКабинет.УидТекущейСессии();
	ЭтоОблако = ПараметрыСеанса.ОбластьДанныхИспользование;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект);
	
	//Справочники.ВнешниеСистемы.ПодключитьВнешнююСистему(РеквизитФормыВЗначение("Объект"), Отказ, УИДСессии);
	Константы.ИспользуетсяКонтурСтрахование.Установить(Объект.Используется);

КонецПроцедуры

&НаКлиенте
// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
	СтруктураОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	Оповестить("ЗаписанаВнешняяСистема", СтруктураОповещения);  
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЭтотОбъект.clientId = "" Или ЭтотОбъект.clientSecret = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поля ""clientId"" и ""clientSecret"" обязательны для заполнения.",,,, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименование();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиКоманд

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлюч" 
//
Процедура СоздатьКлюч(Команда)
	
	Объект.КлючПриложения = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик коменты: Удалить, Помечает на удаление текущую внешнюю систему
//
Процедура УдалитьИЗакрыть(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Вы точнохотите пометить на удаление данный элемент справочника?",
        РежимДиалогаВопрос.ДаНетОтмена,
        0, 
        КодВозвратаДиалога.Да
    );    
 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();

	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет параметры внешней системы.
//
Процедура ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект)
	
	ПараметрыВнешнейСистемы = Новый Структура;
	ПараметрыВнешнейСистемы.Вставить("clientId"				, ЭтотОбъект.clientId);
	ПараметрыВнешнейСистемы.Вставить("clientSecret"			, ЭтотОбъект.clientSecret);
	ПараметрыВнешнейСистемы.Вставить("Демо"					, ЭтотОбъект.Демо);

	МассивОрганизаций = Новый Массив;
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.ТаблицаОрганизаций Цикл			
		МассивОрганизаций.Добавить(Новый Структура("mediId, name, inn, kpp, partyTypeCode", СтрокаТч.mediId, СтрокаТч.name, СтрокаТч.inn, СтрокаТч.kpp, СтрокаТч.partyTypeCode)); 			
	КонецЦикла;
	
	Если ПараметрыВнешнейСистемы.Свойство("МассивОрганизаций") Тогда
		ПараметрыВнешнейСистемы.МассивОрганизаций = МассивОрганизаций;
	Иначе
		ПараметрыВнешнейСистемы.Вставить("МассивОрганизаций", МассивОрганизаций);
	КонецЕсли;
	
	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, проверяет публикацию информационной базы.
//
Функция ПроверитьПубликациюИнформационнойБазы()
	
	УстановитьСлужебногоПользователя();
	
	РезультатПроверки = ЛичныйКабинет.ПроверитьПубликациюВнешнейСистемы(Константы.ВнешняяПубликацияАдрес.Получить());
	
	Если РезультатПроверки.ВыполненоУспешно Тогда
		Возврат РезультатПроверки.ПубликацияВерна;  
	КонецЕсли;  
	
	Если НЕ (РезультатПроверки.ВыполненоУспешно И РезультатПроверки.ПубликацияВерна = Истина) Тогда    
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При проверке публикации возникла ошибка: ';en='With checking publications originated mistake:'") + РезультатПроверки.ОписаниеОшибки);
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, устанавливает служебного пользователя.
//
Процедура УстановитьСлужебногоПользователя()
	
	Если НЕ ЗначениеЗаполнено(Константы.ВнешняяПубликацияПользователь.Получить()) Тогда
		
		СлужебныйПользователь = ПользователиСтоматология.СлужебныйПользовательAPI();
		
		Если НЕ ЗначениеЗаполнено(СлужебныйПользователь) Тогда
			
			СлужебныйПользователь = ПользователиСтоматология.СоздатьСлужебногоПользователяAPI();
			
		КонецЕсли;
		
		Константы.ВнешняяПубликацияПользователь.Установить(СлужебныйПользователь);
		
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
	    ПометитьНаУдаление();
		
		ПараметрыОповещения = Новый Структура;
        ПараметрыОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
		ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);

		Оповестить("УдаленаВнешняяСистема", ПараметрыОповещения);
		
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПометитьНаУдаление()
	
		ВнешняяСистемаОбъект = Объект.Ссылка.ПолучитьОбъект();
		ВнешняяСистемаОбъект.ПометкаУдаления = Истина;
		ВнешняяСистемаОбъект.Используется = Ложь;
		
		Попытка
			ВнешняяСистемаОбъект.Записать();
		Исключение 
 		КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТокен(Команда)
	
	Результат = GetToken();
	
	Объект.ТокенДоступа = Результат.Получить("access_token");
	
КонецПроцедуры

&НаКлиенте
Функция GetToken()
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
    
    Запись = Новый ЗаписьТекста(ВременныйФайл, "UTF-8");
    Запись.Записать(""+clientId+":"+clientSecret);
    Запись.Закрыть();
	
    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
	
	КодТокена = Сред(Base64Строка(ДвДанные),5);
	КодТокена = СтрЗаменить(КодТокена,Символы.ПС,"");
	КодТокена = СтрЗаменить(КодТокена,Символы.ВК,"");
	
	Запрос = Новый HTTPЗапрос("/connect/token");
	Запрос.Заголовки.Вставить("Authorization", "Basic "+КодТокена);
	
	ИмяФайлаОтправки = ПолучитьимяВременногоФайла("txt");
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаОтправки,"UTF-8");
	
	ЗаписьТекста.ЗаписатьСтроку("--"+boundary);
	ЗаписьТекста.ЗаписатьСтроку("Content-Disposition: form-data; name=""grant_type""");
	ЗаписьТекста.ЗаписатьСтроку("");
	ЗаписьТекста.ЗаписатьСтроку("client_credentials");
	
	ЗаписьТекста.ЗаписатьСтроку("--"+boundary);
	ЗаписьТекста.ЗаписатьСтроку("Content-Disposition: form-data; name=""scope""");
	ЗаписьТекста.ЗаписатьСтроку("");
	ЗаписьТекста.ЗаписатьСтроку("medi_api");
	
	ЗаписьТекста.ЗаписатьСтроку("--"+boundary+"--");
 
	ЗаписьТекста.Закрыть();
	
	ОБ_ДД=Новый ДвоичныеДанные(имяФайлаОтправки);
    Стр_Base64=Base64Строка(ОБ_ДД);
    ОБ_ДД=Base64Значение(Сред(Стр_Base64,5));
    ОБ_ДД.Записать(имяФайлаОтправки);
	
	ФайлОтправки = Новый Файл(имяФайлаОтправки);
	РазмерФайлаОтправки = XMLСтрока(ФайлОтправки.Размер());
	
	Запрос.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary="+boundary);
	Запрос.Заголовки.Вставить("Content-Lenght", РазмерФайлаОтправки);	

	Запрос.УстановитьТелоИзДвоичныхДанных(ОБ_ДД);
	
	Ответ = Клиент_POST(Запрос,ХостТокен());
	
	Если Ответ.КодСостояния = 404 Тогда
		ВызватьИсключение "Неверный путь: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния = 403 Тогда
		ВызватьИсключение "Нет доступа: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния = 401 Тогда
		ВызватьИсключение "Запрос не авторизован: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния >= 300 Тогда
		ВызватьИсключение "Не удалось выполнить запрос: " + Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Возврат JSON_Прочитать(Ответ.ПолучитьТелоКакСтроку());

КонецФункции

&НаСервереБезКонтекста
Функция JSON_Прочитать(Значение)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция Клиент_POST(Запрос, Хост)
	
	Возврат ВыполнитьHTTPМетод("POST", Запрос, Хост);
		
КонецФункции

&НаКлиенте
Функция ВыполнитьHTTPМетод(Метод, Запрос, Хост)
	
	Возврат Соединение(Хост).ВызватьHTTPМетод(Метод, Запрос);
	
КонецФункции

&НаКлиенте
Функция Соединение(Хост)

	Порт = 443;
	
	Соединение = Новый HTTPСоединение(Хост, Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		
	Возврат Соединение;

КонецФункции

&НаКлиенте
Функция ХостТокен()
	
	Возврат ?(ЭтотОбъект.Демо ,"identity.testkontur.ru", "identity.kontur.ru");
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСписокОрганизаций(Команда)

	Если Не ЗначениеЗаполнено(Объект.ТокенДоступа) Тогда
		ВызватьИсключение "Не указан токен";
	КонецЕсли;
	
	Результат = GetAccessiblePartiesInfo();
	
	ТаблицаОрганизаций.Очистить();
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для Каждого Эл Из Результат Цикл
			НоваяСтрока = ТаблицаОрганизаций.Добавить();
			
			НоваяСтрока.mediId			= Эл.Получить("mediId");
			НоваяСтрока.name			= Эл.Получить("name");
			НоваяСтрока.inn				= Эл.Получить("inn");
			НоваяСтрока.kpp				= Эл.Получить("kpp");
			НоваяСтрока.partyTypeCode	= Эл.Получить("partyTypeCode");
			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция GetAccessiblePartiesInfo()

	Запрос = Новый HTTPЗапрос("/V2/parties");
	Запрос.Заголовки.Вставить("Authorization", "Bearer "+Объект.ТокенДоступа);
	
	Ответ = Клиент_get(Запрос,ХостАпи());
	
	Если Ответ.КодСостояния = 403 Тогда
		ВызватьИсключение "Нет доступа ни к одной организации: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния = 401 Тогда
		ВызватьИсключение "Запрос не авторизован: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния >= 300 Тогда
		ВызватьИсключение "Не удалось выполнить запрос: " + Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Возврат JSON_Прочитать(Ответ.ПолучитьТелоКакСтроку());

КонецФункции

&НаКлиенте
Функция Клиент_GET(Запрос, Хост)
	
	Возврат ВыполнитьHTTPМетод("GET", Запрос, Хост);
		
КонецФункции

&НаКлиенте
Функция ХостАпи()
	
	Возврат ?(ЭтотОбъект.Демо, "medi-api.testkontur.ru", "medi-api.kontur.ru");
	
КонецФункции

#КонецОбласти
